Tekla.Structures.ModelInternal.dotBuildingHierarchyItemOperation_e
Enumeration for all operations

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemOperation_e.DOT_GET_CHILDREN_OBJECTS
Get children objects.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemOperation_e.DOT_SELECT_ASSIGNED_OBJECTS
Select assigned objects in 3d view.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemOperation_e.DOT_HIDE_ASSIGNED_OBJECTS
Hide assigned objects in 3d view.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemOperation_e.DOT_SHOW_ASSIGNED_OBJECTS
Show previously hidden assigned objects in 3d view.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemOperation_e.DOT_SHOW_ONLY_ASSIGNED_OBJECTS
Show only assigned objects in 3d view.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItemOperation_e.DOT_GET_SPACES
Get child space objects.